[
    {
      "gameID": 201,
      "Title": "Shell Shockers",
      "SecondTitle": "Egg-citing Multiplayer Battles",
      "SmallTitle": "Engage in egg-themed FPS combat",
      "Description": "Shell Shockers is a unique multiplayer first-person shooter where players control armed eggs in intense battles. Choose your egg class, wield powerful weapons, and crack your opponents to dominate the battlefield.",
      "HTP": "Use WASD to move, click to shoot, and spacebar to jump. Select different weapons and utilize strategy to outplay other players.",
      "Background": "https://imgs.crazygames.com/shellshockersio_16x9/20250514022643/shellshockersio_16x9-cover?metadata=none&quality=70&width=425",
      "Genre": "FPS",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/shellshockersio"
    },
    {
      "gameID": 202,
      "Title": "Smash Karts",
      "SecondTitle": "Chaotic Kart Battles",
      "SmallTitle": "Race and battle in explosive arenas",
      "Description": "Smash Karts is a fast-paced multiplayer kart battle game where players race around arenas, collect weapons, and eliminate opponents to become the ultimate kart champion.",
      "HTP": "Drive using arrow keys or WASD, collect power-ups, and use weapons to take down other karts while avoiding their attacks.",
      "Background": "https://imgs.crazygames.com/smash-karts_16x9/20250513142023/smash-karts_16x9-cover?metadata=none&quality=70&width=425",
      "Genre": "Racing/Battle",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/smash-karts"
    },
    {
      "gameID": 203,
      "Title": "Bullet Force",
      "SecondTitle": "Action-Packed FPS",
      "SmallTitle": "Experience intense modern combat",
      "Description": "Bullet Force is a thrilling multiplayer first-person shooter featuring realistic weapons and environments. Engage in various game modes, customize your loadout, and compete against players worldwide.",
      "HTP": "Use WASD to move, mouse to aim and shoot, and spacebar to jump. Customize your weapons and tactics to suit your playstyle.",
      "Background": "https://imgs.crazygames.com/bullet-force-multiplayer_16x9/20250422192901/bullet-force-multiplayer_16x9-cover?metadata=none&quality=70&width=375.5",
      "Genre": "FPS",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/bullet-force-multiplayer"
    },
    {
      "gameID": 204,
      "Title": "Cut the Rope",
      "SecondTitle": "Feed the Hungry Om Nom",
      "SmallTitle": "Solve puzzles to satisfy Om Nom's sweet tooth",
      "Description": "Cut the Rope is a delightful physics-based puzzle game where players cut ropes to deliver candy to the adorable creature, Om Nom. Navigate through challenging levels and collect stars along the way.",
      "HTP": "Click and drag to cut ropes, use various interactive elements, and strategize to collect stars and feed Om Nom.",
      "Background": "https://imgs.crazygames.com/cut-the-rope-ebx_16x9/20240530085010/cut-the-rope-ebx_16x9-cover?metadata=none&quality=70&width=375.5",
      "Genre": "Puzzle",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/cut-the-rope"
    },
    {
      "gameID": 205,
      "Title": "Little Alchemy",
      "SecondTitle": "Create the World from Scratch",
      "SmallTitle": "Combine elements to discover new items",
      "Description": "Little Alchemy is an engaging puzzle game where players start with basic elements and combine them to create new items. Explore and discover over 500 items as you craft your own universe.",
      "HTP": "Click and drag elements to combine them, experiment with different combinations, and uncover new items.",
      "Background": "https://imgs.crazygames.com/games/little-alchemy/cover-1655828649117.png?metadata=none&quality=70&width=375.5",
      "Genre": "Puzzle",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/little-alchemy"
    },
    {
      "gameID": 206,
      "Title": "Bloxd.io",
      "SecondTitle": "Block-Building Adventures",
      "SmallTitle": "Explore, build, and survive in a blocky world",
      "Description": "Bloxd.io is a Minecraft-inspired multiplayer game where players can explore vast worlds, gather resources, build structures, and interact with others. Engage in various game modes for endless fun.",
      "HTP": "Use WASD to move, mouse to interact and build, and number keys to select items. Collaborate or compete with other players in different modes.",
      "Background": "https://imgs.crazygames.com/games/bloxdhop-io/cover_16x9-1709115453824.png?metadata=none&quality=70&width=375.5",
      "Genre": "Sandbox/Adventure",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/bloxdhop-io"
    },
    {
      "gameID": 207,
      "Title": "EvoWars.io",
      "SecondTitle": "Evolutionary Battle Arena",
      "SmallTitle": "Fight and evolve in a fast-paced arena",
      "Description": "EvoWars.io is an addictive multiplayer game where players battle opponents to gain experience and evolve into stronger warriors. Collect orbs, defeat enemies, and become the ultimate fighter.",
      "HTP": "Use your mouse to move and attack, collect orbs to gain experience, and avoid stronger opponents until you're ready to take them on.",
      "Background": "https://imgs.crazygames.com/games/evowarsio/cover_16x9-1736776369217.png?metadata=none&quality=70&width=375.5",
      "Genre": "Action/IO",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/evowarsio"
    },
      {
      "gameID": 208,
      "Title": "Deadshot.io",
      "SecondTitle": "Precision Shooting Challenges",
      "SmallTitle": "Test your aim in competitive shooting matches",
      "Description": "Deadshot.io is an intense multiplayer FPS that puts your reflexes and precision to the test. Dive into fast-paced combat arenas, choose from a variety of weapons, and prove your dominance in skill-based shooting gameplay. Whether you're sniping from afar or rushing in with a rifle, quick thinking and accuracy are key to victory.",
      "HTP": "Use WASD to move, mouse to aim and shoot, and spacebar to jump. Choose your weapon wisely and keep moving to avoid enemy fire.",
      "Background": "https://imgs.crazygames.com/games/deadshot-io/cover_16x9-1694770506842.png?metadata=none&quality=70&width=353",
      "Genre": "FPS",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/deadshot-io"
    },
    {
      "gameID": 209,
      "Title": "Taming.io",
      "SecondTitle": "Survive and Tame Beasts",
      "SmallTitle": "Build, fight, and tame magical animals",
      "Description": "Taming.io is a survival game set in a magical world where players gather resources, craft tools, and tame wild creatures to aid in combat. Build your base, form alliances, and evolve alongside your animals in this dynamic and competitive multiplayer experience. Each new pet you tame adds a unique strategy to your survival journey.",
      "HTP": "Use WASD to move, mouse to interact, and number keys to manage your items. Collect resources, fight enemies, and tame pets to support you.",
      "Background": "https://imgs.crazygames.com/taming-io_16x9/20231110124553/taming-io_16x9-cover?metadata=none&quality=70&width=375.5",
      "Genre": "Survival/Strategy",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/taming-io"
    },
    {
      "gameID": 210,
      "Title": "Basketball Stars",
      "SecondTitle": "Show Off Your Court Skills",
      "SmallTitle": "1v1 basketball action with style",
      "Description": "Basketball Stars is a two-player basketball game where you face off against opponents in thrilling matches. Use quick moves, flashy dunks, and strategic blocks to outscore your rivals. Whether you play solo or with a friend, the game offers smooth controls and multiple modes for endless sports entertainment.",
      "HTP": "Use arrow keys or WASD to move, and the action keys to shoot, steal, or block. Time your moves to score and defend effectively.",
      "Background": "https://imgs.crazygames.com/basketballstarsBigb.png?metadata=none&quality=70&width=353",
      "Genre": "Sports",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/basketball-stars"
    },
    {
      "gameID": 211,
      "Title": "Happy Wheels",
      "SecondTitle": "Dangerously Fun Ragdoll Mayhem",
      "SmallTitle": "Navigate deadly levels with unique characters",
      "Description": "Happy Wheels is a hilariously violent physics-based platformer where players must survive deadly obstacle courses. Control quirky characters in wheelchairs, on bikes, and more as you dodge traps, spikes, and explosive hazards. Creativity and chaos collide in each gruesome level, offering both challenge and comedy.",
      "HTP": "Use arrow keys to move, spacebar to jump or interact. Carefully navigate through traps and use timing to your advantage.",
      "Background": "https://imgs.crazygames.com/games/happy-wheels/cover-1688034516340.png?metadata=none&quality=70&width=353",
      "Genre": "Platformer/Action",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/happy-wheels"
    },
    {
      "gameID": 212,
      "Title": "Voxiom.io",
      "SecondTitle": "Voxel-Based FPS Battles",
      "SmallTitle": "Shoot, build, and survive in a blocky world",
      "Description": "Voxiom.io is a voxel-style first-person shooter that combines combat, crafting, and mining. Battle in real-time against other players in destructible environments where the terrain is your weapon and shield. Use strategy and quick reflexes to gain the upper hand and climb the ranks in this ever-changing arena.",
      "HTP": "Use WASD to move, mouse to aim and shoot, and number keys to switch tools. Mine blocks and build structures to defend or gain tactical advantage.",
      "Background": "https://imgs.crazygames.com/games/voxiom-io/cover_16x9-1714408559317.png?metadata=none&quality=70&width=353",
      "Genre": "FPS/Survival",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/voxiom-io"
    },
    {
      "gameID": 213,
      "Title": "Golf Orbit",
      "SecondTitle": "Launch Balls into Space",
      "SmallTitle": "Upgrade and hit beyond the skies",
      "Description": "Golf Orbit is a quirky arcade sports game where players aim to launch the golf ball as far as possible — sometimes into orbit! Earn coins from your hits, upgrade your strength and accuracy, and see how far you can fly. It's golf, but with rocket-powered flair and ridiculous distances.",
      "HTP": "Click to set power and direction, then launch the ball. Use upgrades to improve your shot and reach higher scores.",
      "Background": "https://imgs.crazygames.com/golf-orbit_16x9/20240620070701/golf-orbit_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "Arcade/Sports",
      "Rating": 4,
      "EmbedLink": "https://www.crazygames.com/embed/golf-orbit"
    },
    {
      "gameID": 214,
      "Title": "Helix Jump",
      "SecondTitle": "Twisting Tower Descent",
      "SmallTitle": "Bounce your ball through the spiral",
      "Description": "Helix Jump is a fast-paced reflex game where you guide a bouncing ball down a twisting helix tower. Avoid red platforms while breaking through the gaps to descend as far as possible. The simple gameplay and vibrant visuals make it a thrilling casual challenge.",
      "HTP": "Use left and right arrow keys or swipe to rotate the helix and guide the ball through gaps while avoiding red platforms.",
      "Background": "https://imgs.crazygames.com/games/helix-jump/cover_16x9-1733222901873.png?metadata=none&quality=70&width=353",
      "Genre": "Arcade/Reflex",
      "Rating": 4,
      "EmbedLink": "https://www.crazygames.com/embed/helix-jump"
    },
      {
      "gameID": 215,
      "Title": "Getaway Shootout",
      "SecondTitle": "Chaotic Race to Escape",
      "SmallTitle": "Compete in wild races to the getaway point",
      "Description": "Getaway Shootout is a frantic two-player game where you race against others to reach the getaway vehicle. With limited movement options, you can only jump left or right, making each race unpredictable and hilarious. Collect weapons along the way to hinder your opponents and secure your escape.",
      "HTP": "Use W and E (Player 1) or I and O (Player 2) to jump left or right. Reach the getaway vehicle first to win the round.",
      "Background": "https://imgs.crazygames.com/getaway-shootout_16x9/20241230044730/getaway-shootout_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "Action/Racing",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/getaway-shootout"
    },
    {
      "gameID": 216,
      "Title": "Tap-Tap Shots",
      "SecondTitle": "Endless Basketball Challenge",
      "SmallTitle": "Tap to shoot hoops continuously",
      "Description": "Tap-Tap Shots is an addictive basketball game where you tap to make the ball jump and score consecutive baskets. Each successful shot moves the hoop to a new position, challenging your timing and precision. Aim for the highest score in this endless basketball adventure.",
      "HTP": "Click or tap to make the ball jump. Time your taps to score baskets before the timer runs out.",
      "Background": "https://imgs.crazygames.com/games/tap-tap-shots/cover-1655202548222.png?metadata=none&quality=70&width=353",
      "Genre": "Sports/Arcade",
      "Rating": 4.2,
      "EmbedLink": "https://www.crazygames.com/embed/tap-tap-shots"
    },
    {
      "gameID": 217,
      "Title": "Time Shooter 3: SWAT",
      "SecondTitle": "Time-Bending Tactical Combat",
      "SmallTitle": "Manipulate time to defeat terrorists",
      "Description": "Time Shooter 3: SWAT is a first-person shooter where time moves only when you move. Inspired by the SuperHot series, this game challenges you to eliminate terrorists and rescue hostages using strategic movements and precise shooting. Equip SWAT gear and utilize time to your advantage in intense firefights.",
      "HTP": "Use WASD to move, mouse to aim and shoot. Remember, time moves when you do. Plan your actions carefully to outmaneuver enemies.",
      "Background": "https://imgs.crazygames.com/time-shooter-3-swat_16x9/20241113103402/time-shooter-3-swat_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "FPS/Strategy",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/time-shooter-3-swat"
    },
    {
      "gameID": 218,
      "Title": "Rocket Bot Royale",
      "SecondTitle": "Battle Royale with Tanks",
      "SmallTitle": "Engage in explosive tank battles",
      "Description": "Rocket Bot Royale is an action-packed multiplayer game where you control a rocket-powered tank in a battle royale setting. Navigate dynamic terrains, use your cannon to propel and attack, and outlast opponents to claim victory. Collect coins and upgrade your tank for enhanced performance.",
      "HTP": "Use A/D to move, mouse to aim and shoot. Utilize your cannon's recoil to navigate the map and avoid the rising water.",
      "Background": "https://imgs.crazygames.com/games/rocket-bot-royale/cover_16x9-1732723484943.png?metadata=none&quality=70&width=353",
      "Genre": "Multiplayer/Battle Royale",
      "Rating": 4.5,
      "EmbedLink": "https://www.crazygames.com/embed/rocket-bot-royale"
    },
    {
      "gameID": 219,
      "Title": "Screamals",
      "SecondTitle": "Survive the Horror",
      "SmallTitle": "Face terrifying creatures in a haunted setting",
      "Description": "Dive into a spine-chilling adventure where you confront terrifying creatures in a haunted environment. Use various weapons and strategies to survive waves of monstrous foes. The atmospheric design and intense gameplay keep you on edge throughout your survival challenge.",
      "HTP": "Use WASD to move, mouse to aim and shoot. Manage your ammo carefully and keep moving to avoid enemy attacks.",
      "Background": "https://imgs.crazygames.com/screamals_16x9/20250513041357/screamals_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "Horror / Action",
      "Rating": 4.4,
      "EmbedLink": "https://www.crazygames.com/embed/screamals"
    },
    {
      "gameID": 220,
      "Title": "Zombie Space Episode 2",
      "SecondTitle": "Survive the Space Station Outbreak",
      "SmallTitle": "Fight zombies and solve puzzles in space",
      "Description": "Continue the thrilling saga in this second episode where you navigate a space station overrun by zombies. Solve puzzles, combat the undead, and uncover the mystery behind the outbreak. Immersive storytelling and challenging gameplay make this a must-play for horror fans.",
      "HTP": "Use WASD to move, mouse to aim and shoot. Solve puzzles and explore rooms to survive the zombie outbreak.",
      "Background": "https://imgs.crazygames.com/zombie-space-episode-2-ajp_16x9/20250515082821/zombie-space-episode-2-ajp_16x9-cover?metadata=none&quality=70&width=375.5",
      "Genre": "Horror / Adventure",
      "Rating": 4.4,
      "EmbedLink": "https://www.crazygames.com/embed/zombie-space-episode-2-ajp"
    },
    {
      "gameID": 221,
      "Title": "Miniblox",
      "SecondTitle": "Voxel-Based Multiplayer Adventures",
      "SmallTitle": "Explore, build, and compete in diverse minigames",
      "Description": "Miniblox is an online game featuring voxelated graphics and a diverse selection of minigames. Players can delve into vibrant worlds, engage in creative building, and participate in competitive modes such as PvP battles and parkour challenges. With endless possibilities and social features, Miniblox offers a rich and dynamic gaming experience.",
      "HTP": "Use WASD to move, mouse to interact, and follow in-game instructions for specific minigames. Explore, build, and compete with other players in various game modes.",
      "Background": "https://imgs.crazygames.com/miniblox_16x9/20240617083401/miniblox_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "Adventure/Multiplayer",
      "Rating": 4.3,
      "EmbedLink": "https://www.crazygames.com/embed/miniblox"
    },
    {
      "gameID": 222,
      "Title": "Stickman Destruction 3 Heroes",
      "SecondTitle": "Ragdoll Physics Mayhem",
      "SmallTitle": "Cause chaos and destruction with stickman heroes",
      "Description": "Stickman Destruction 3 Heroes is a physics-based game where players control stickman characters to perform stunts and cause maximum destruction. Utilize various vehicles and props to create spectacular crashes and earn points. The game's ragdoll mechanics and explosive scenarios provide endless entertainment.",
      "HTP": "Select a vehicle, position your stickman, and click to launch. Aim for obstacles to maximize destruction and earn higher scores.",
      "Background": "https://imgs.crazygames.com/stickman-destruction-3-heroes/20210311140018/stickman-destruction-3-heroes-cover?metadata=none&quality=70&width=353",
      "Genre": "Action/Physics",
      "Rating": 4.2,
      "EmbedLink": "https://www.crazygames.com/embed/stickman-destruction-3-heroes"
    },
    {
      "gameID": 223,
      "Title": "Block Wall Destroyer",
      "SecondTitle": "Idle Destruction Frenzy",
      "SmallTitle": "Demolish walls and upgrade your power",
      "Description": "Block Wall Destroyer is an addictive idle game where players aim to break through walls by clicking or tapping. As you progress, earn coins to upgrade your strength and speed, allowing for more efficient destruction. The game combines simple mechanics with satisfying visual effects, making it a perfect casual experience.",
      "HTP": "Click or tap to break the wall. Use earned coins to upgrade your abilities and break through tougher walls faster.",
      "Background": "https://imgs.crazygames.com/block-wall-destroyer_16x9/20250513090809/block-wall-destroyer_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "Idle/Clicker",
      "Rating": 4.1,
      "EmbedLink": "https://www.crazygames.com/embed/block-wall-destroyer"
    },
    {
      "gameID": 224,
      "Title": "Basket Random",
      "SecondTitle": "Unpredictable Basketball Matches",
      "SmallTitle": "Experience wacky physics in basketball duels",
      "Description": "Basket Random is a humorous basketball game featuring ragdoll physics and random elements. Players control two ragdoll characters in one-on-one matches where the environment and conditions change unpredictably. The game's quirky mechanics and unexpected scenarios provide endless fun and laughter.",
      "HTP": "Use the W key (Player 1) and the Up arrow key (Player 2) to jump and shoot. Adapt to changing conditions and outscore your opponent.",
      "Background": "https://imgs.crazygames.com/basket-random_16x9/20240617090207/basket-random_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "Sports/Physics",
      "Rating": 4.3,
      "EmbedLink": "https://www.crazygames.com/embed/basket-random"
    },
    {
      "gameID": 225,
      "Title": "Planet Clicker 2",
      "SecondTitle": "Intergalactic Resource Management",
      "SmallTitle": "Expand your civilization across planets",
      "Description": "Planet Clicker 2 is an idle clicker game where players aim to colonize and develop planets by generating resources. Start with a single planet and expand your civilization by upgrading technologies and exploring new worlds. The game's incremental mechanics and space-themed setting offer a captivating experience.",
      "HTP": "Click to generate resources, invest in upgrades, and unlock new planets to expand your intergalactic empire.",
      "Background": "https://imgs.crazygames.com/planet-clicker-2/20220125105239/planet-clicker-2-cover?metadata=none&quality=70&width=353",
      "Genre": "Idle/Clicker",
      "Rating": 4.4,
      "EmbedLink": "https://www.crazygames.com/embed/planet-clicker-2"
    },
    {
      "gameID": 226,
      "Title": "Grass Land",
      "SecondTitle": "Explore and Solve Puzzles",
      "SmallTitle": "Adventure through lush landscapes",
      "Description": "Embark on a journey through lush landscapes filled with puzzles and hidden secrets. Interact with the environment, solve challenges, and uncover the story behind the land's mysteries. Serene visuals and engaging puzzles offer a delightful and relaxing experience.",
      "HTP": "Use arrow keys or WASD to move. Interact with objects using the action key. Solve puzzles to progress.",
      "Background": "https://imgs.crazygames.com/grass-land-cei_16x9/20250512053720/grass-land-cei_16x9-cover?metadata=none&quality=70&width=375.5",
      "Genre": "Adventure / Puzzle",
      "Rating": 4.2,
      "EmbedLink": "https://www.crazygames.com/embed/grass-land-cei"
    },
    {
      "gameID": 227,
      "Title": "Moto X3M",
      "SecondTitle": "Thrilling Motorcycle Stunt Challenges",
      "SmallTitle": "Navigate obstacle-filled tracks with speed and precision",
      "Description": "Moto X3M is an exciting bike racing game where players tackle challenging tracks filled with obstacles and ramps. Perform stunts, avoid crashes, and race against the clock to achieve the best time. With numerous levels and increasing difficulty, Moto X3M offers endless adrenaline-pumping fun.",
      "HTP": "Use the arrow keys to accelerate, brake, and tilt your bike. Complete each level as quickly as possible while avoiding crashes.",
      "Background": "https://imgs.crazygames.com/games/moto-x3m/cover_16x9-1700625476572.png?metadata=none&quality=70&width=375.5",
      "Genre": "Racing/Stunt",
      "Rating": 4.6,
      "EmbedLink": "https://www.crazygames.com/embed/moto-x3m"
    },
    {
      "gameID": 228,
      "Title": "Rainbow Friends Survivors",
      "SecondTitle": "Action Packed Survival",
      "SmallTitle": "Battle the Blue Monster and Alpha Monster",
      "Description": "In this action-packed adventure, you face off against a rising invasion led by the Blue Monster and the Alpha Monster. Navigate each level, defeat enemies, or reprogram them to fight by your side. Use strategy and quick thinking to turn the tide in this thrilling battle!",
      "HTP": "Use WASD to move, mouse to aim and attack. Strategically reprogram enemies to help you survive waves of attacks.",
      "Background": "https://imgs.crazygames.com/rainbow-friends-survivors_16x9/20250225024552/rainbow-friends-survivors_16x9-cover?metadata=none&quality=70&width=353",
      "Genre": "Action / Survival",
      "Rating": 4.4,
      "EmbedLink": "https://www.crazygames.com/embed/rainbow-friends-survivors"
    },
    {
      "gameID": 229,
      "Title": "Duck Life",
      "SecondTitle": "Train Your Duck for Competitive Races",
      "SmallTitle": "Develop skills and compete in duck racing tournaments",
      "Description": "Duck Life is an adventure game where you train a duckling to become a champion racer. Engage in various training activities to improve your duck's abilities in running, swimming, and flying. Participate in races to earn coins and upgrade your training facilities, aiming to become the ultimate duck racing champion.",
      "HTP": "Use arrow keys to train your duck in different skills. Enter races and use your trained abilities to win and earn rewards.",
      "Background": "https://imgs.crazygames.com/ducklife.png?metadata=none&quality=70&width=353",
      "Genre": "Adventure/Simulation",
      "Rating": 4.3,
      "EmbedLink": "https://www.crazygames.com/embed/ducklife"
    },
    {
      "gameID": 230,
      "Title": "Euro Truck Driving Simulator 2025",
      "SecondTitle": "Realistic Truck Driving",
      "SmallTitle": "Transport heavy cargo through challenging routes",
      "Description": "Euro Truck Driving Simulator 2025 is a thrilling game where you take on the role of a skilled truck driver managing challenging transport missions. Haul heavy cargo, fuel tankers, and machinery through rugged terrain, mountain roads, and bustling cities. Navigate sharp turns and tough routes as you handle logistics with precision and master the art of trucking.",
      "HTP": "Use arrow keys or WASD to drive, spacebar to brake. Follow traffic rules and complete missions on time.",
      "Background": "https://imgs.crazygames.com/euro-truck-driving-simulator-2025_16x9/20250107093845/euro-truck-driving-simulator-2025_16x9-cover?metadata=none&quality=70&width=353",
      "Rating": 4.3,
      "EmbedLink": "https://www.crazygames.com/embed/euro-truck-driving-simulator-2025"
    }
]